In [115]:
%load_ext sql
%sql postgresql://appdev@data/appdev

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: appdev@appdev'

In [125]:
%%sql 
SELECT drivers.forename, drivers.surname, drivers.driverid, count(results.rank) as wins 
FROM drivers
JOIN results USING(driverid) 
WHERE results.rank = 1 
GROUP BY driverid
ORDER BY wins desc;

31 rows affected.

[('Kimi', 'Räikkönen', 8, 41),
 ('Lewis', 'Hamilton', 1, 38),
 ('Sebastian', 'Vettel', 20, 31),
 ('Fernando', 'Alonso', 4, 22),
 ('Michael', 'Schumacher', 30, 21),
 ('Nico', 'Rosberg', 3, 20),
 ('Mark', 'Webber', 17, 18),
 ('Felipe', 'Massa', 13, 15),
 ('Daniel', 'Ricciardo', 817, 9),
 ('Jenson', 'Button', 18, 8),
 ('Rubens', 'Barrichello', 22, 6),
 ('Sergio', 'Pérez', 815, 4),
 ('Juan', 'Pablo Montoya', 31, 3),
 ('Nick', 'Heidfeld', 2, 2),
 ('Heikki', 'Kovalainen', 5, 2),
 ('Nico', 'Hülkenberg', 807, 2),
 ('Ralf', 'Schumacher', 23, 1),
 ('Jarno', 'Trulli', 15, 1),
 ('Timo', 'Glock', 10, 1),
 ('Valtteri', 'Bottas', 822, 1),
 ('Kamui', 'Kobayashi', 155, 1),
 ('Vitaly', 'Petrov', 808, 1),
 ('Bruno', 'Senna', 811, 1),
 ('Max', 'Verstappen', 830, 1),
 ('Esteban', 'Gutiérrez', 821, 1),
 ('Robert', 'Kubica', 9, 1),
 ('Giancarlo', 'Fisichella', 21, 1),
 ('Pedro', 'de la Rosa', 37, 1),
 ('Adrian', 'Sutil', 16, 1),
 ('Romain', 'Grosjean', 154, 1),
 ('Daniil', 'Kvyat', 826, 1)]

In [96]:
%%sql
SELECT drivers.driverref, constructors.name, count(*) from drivers
         JOIN results USING (driverid)
         JOIN constructors USING (constructorid)
         WHERE results.statusid = 1
         GROUP BY drivers.driverref, constructors.name
         ORDER BY count
         DESC
         LIMIT 10;

10 rows affected.

[('michael_schumacher', 'Ferrari', 141),
 ('massa', 'Ferrari', 112),
 ('rosberg', 'Mercedes', 109),
 ('webber', 'Red Bull', 100),
 ('vettel', 'Red Bull', 97),
 ('raikkonen', 'Ferrari', 92),
 ('button', 'McLaren', 87),
 ('alonso', 'Ferrari', 87),
 ('coulthard', 'McLaren', 85),
 ('hamilton', 'Mercedes', 85)]

In [112]:
%%sql
SELECT drivers.driverref, constructors.name, count(*) from drivers
          JOIN results USING (driverid)
          JOIN constructors USING (constructorid)
          WHERE results.statusid = 1
          GROUP BY drivers.driverref, constructors.name
          ORDER BY count
          DESC
          LIMIT 10;

10 rows affected.

[('michael_schumacher', 'Ferrari', 141),
 ('massa', 'Ferrari', 112),
 ('rosberg', 'Mercedes', 109),
 ('webber', 'Red Bull', 100),
 ('vettel', 'Red Bull', 97),
 ('raikkonen', 'Ferrari', 92),
 ('button', 'McLaren', 87),
 ('alonso', 'Ferrari', 87),
 ('coulthard', 'McLaren', 85),
 ('hamilton', 'Mercedes', 85)]

In [134]:
%%sql
select driverid, raceid, sum(milliseconds) as milli from pitstops
group by driverid, raceid
order by milli asc
limit 10;

10 rows affected.

[(154, 909, Decimal('18928')),
 (17, 877, Decimal('19066')),
 (4, 877, Decimal('19368')),
 (18, 877, Decimal('19455')),
 (155, 877, Decimal('19529')),
 (13, 877, Decimal('19585')),
 (18, 871, Decimal('19668')),
 (822, 955, Decimal('19732')),
 (10, 877, Decimal('19884')),
 (3, 955, Decimal('20058'))]

In [136]:
%%sql
create view pitstops_view as
select driverid, raceid, sum(milliseconds) as milli from pitstops
group by driverid, raceid
order by raceid asc;

Done.

[]

In [142]:
%%sql 
select drivers.driverref as driver, constructors.name as vehicle, count(constructorid) as car, 
sum(milli) as pitstop from drivers
join results using (driverid)
join pitstops_view using (driverid, raceid)
join constructors using (constructorid)
join status using (statusid) where status = 'Finished'
group by drivers.driverref, constructors.name
order by car desc
limit 10;

10 rows affected.

[('rosberg', 'Mercedes', 95, Decimal('11501262')),
 ('hamilton', 'Mercedes', 85, Decimal('12147994')),
 ('button', 'McLaren', 71, Decimal('8515623')),
 ('vettel', 'Red Bull', 70, Decimal('4927545')),
 ('alonso', 'Ferrari', 70, Decimal('3691856')),
 ('ricciardo', 'Red Bull', 56, Decimal('10948926')),
 ('raikkonen', 'Ferrari', 53, Decimal('3608658')),
 ('bottas', 'Williams', 52, Decimal('9184739')),
 ('hulkenberg', 'Force India', 49, Decimal('9053044')),
 ('webber', 'Red Bull', 49, Decimal('3017372'))]

In [147]:
%%sql select drivers.driverref as driver, constructors.name as car, count(constructorid) as cardriven, 
sum(milli) as totalpitstop, round(sum(milli)/count(results.raceid), 0) as avgpitstop from drivers
join results using (driverid) 
join pitstops_view using (driverid, raceid)
join constructors using (constructorid)
join status USING (statusid) where status = 'Finished' 
group by drivers.driverref, constructors.name
order by avgpitstop ASC
limit 10;

10 rows affected.

[('ambrosio', 'Lotus F1', 1, Decimal('21962'), Decimal('21962')),
 ('rosa', 'HRT', 1, Decimal('22272'), Decimal('22272')),
 ('hulkenberg', 'Renault', 5, Decimal('186700'), Decimal('37340')),
 ('glock', 'Marussia', 2, Decimal('82876'), Decimal('41438')),
 ('bruno_senna', 'Williams', 13, Decimal('574413'), Decimal('44186')),
 ('perez', 'Sauber', 15, Decimal('681053'), Decimal('45404')),
 ('resta', 'Force India', 34, Decimal('1563408'), Decimal('45983')),
 ('ricciardo', 'Toro Rosso', 22, Decimal('1015872'), Decimal('46176')),
 ('raikkonen', 'Lotus F1', 33, Decimal('1532336'), Decimal('46434')),
 ('maldonado', 'Williams', 21, Decimal('982946'), Decimal('46807'))]